app/Controllers/Admin.php

    public function dashboard()
    {
        $data = [
            'sidebar1' => 'open active',
            'sidebar2' => null,
            'sidebar3' => null,
            'submenu1' => null,
            'submenu2' => null,
            'submenu3' => null,
            'submenu4' => null,
            'submenu5' => null,
            'submenu6' => null,
            'submenu7' => null,
            'submenu8' => null,
            'submenu9' => null,
            'submenu10' => null,
            'submenu11' => null,
            'submenu12' => null,
            'submenu13' => null,
            'jumlah_kelas' => (new ModelKelas())->countAllResults(),
            'jumlah_meja' => (new MejaModel())->countAllResults(),
            'jumlah_kursi' => (new KursiModel())->countAllResults(),
            'jumlah_buku' => (new BukuModel())->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `kelas`
SELECT COUNT(*) AS `numrows`
FROM `meja`
SELECT COUNT(*) AS `numrows`
FROM `kursi`
SELECT COUNT(*) AS `numrows`
FROM `buku`