app/Controllers/Umum.php

    public function index()
    {
        $data = [
            'navbar1' => 'active',
            'navbar2' => null,
            'piala' => (new PialaModel())->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `piala`

    public function x1()
    {
        $data = [
            'navbar1' => null,
            'navbar2' => null,
            'tables' => (new MejaModel())->where('id_kelas', '1')->findAll(),
            'chairs' => (new KursiModel())->where('id_kelas', '1')->findAll(),
            'photos' => (new FotoModel())->where('id_kelas', '1')->findAll(),
            'boards' => (new PapanTulisModel())->where('id_kelas', '1')->findAll(),
            'spidols' => (new SpidolModel())->where('id_kelas', '1')->findAll(),
            'pens' => (new PenaModel())->where('id_kelas', '1')->findAll(),
            'rules' => (new PenggarisModel())->where('id_kelas', '1')->findAll(),
            'erasers' => (new PenghapusModel())->where('id_kelas', '1')->findAll(),
---
SELECT *
FROM `meja`
WHERE `id_kelas` = '1'
SELECT *
FROM `kursi`
WHERE `id_kelas` = '1'
SELECT *
FROM `foto`
WHERE `id_kelas` = '1'
SELECT *
FROM `papan_tulis`
WHERE `id_kelas` = '1'
SELECT *
FROM `spidol`
WHERE `id_kelas` = '1'
SELECT *
FROM `pena`
WHERE `id_kelas` = '1'
SELECT *
FROM `penggaris`
WHERE `id_kelas` = '1'
SELECT *
FROM `penghapus`
WHERE `id_kelas` = '1'

    public function x2()
    {
        $data = [
            'navbar1' => null,
            'navbar2' => null,
            'tables' => (new MejaModel())->where('id_kelas', '2')->findAll(),
            'chairs' => (new KursiModel())->where('id_kelas', '2')->findAll(),
            'photos' => (new FotoModel())->where('id_kelas', '2')->findAll(),
            'boards' => (new PapanTulisModel())->where('id_kelas', '2')->findAll(),
            'spidols' => (new SpidolModel())->where('id_kelas', '2')->findAll(),
            'pens' => (new PenaModel())->where('id_kelas', '2')->findAll(),
            'rules' => (new PenggarisModel())->where('id_kelas', '2')->findAll(),
            'erasers' => (new PenghapusModel())->where('id_kelas', '2')->findAll(),
---
SELECT *
FROM `meja`
WHERE `id_kelas` = '2'
SELECT *
FROM `kursi`
WHERE `id_kelas` = '2'
SELECT *
FROM `foto`
WHERE `id_kelas` = '2'
SELECT *
FROM `papan_tulis`
WHERE `id_kelas` = '2'
SELECT *
FROM `spidol`
WHERE `id_kelas` = '2'
SELECT *
FROM `pena`
WHERE `id_kelas` = '2'
SELECT *
FROM `penggaris`
WHERE `id_kelas` = '2'
SELECT *
FROM `penghapus`
WHERE `id_kelas` = '2'

    public function x3()
    {
        $data = [
            'navbar1' => null,
            'navbar2' => null,
            'tables' => (new MejaModel())->where('id_kelas', '4')->findAll(),
            'chairs' => (new KursiModel())->where('id_kelas', '4')->findAll(),
            'photos' => (new FotoModel())->where('id_kelas', '4')->findAll(),
            'boards' => (new PapanTulisModel())->where('id_kelas', '4')->findAll(),
            'spidols' => (new SpidolModel())->where('id_kelas', '4')->findAll(),
            'pens' => (new PenaModel())->where('id_kelas', '4')->findAll(),
            'rules' => (new PenggarisModel())->where('id_kelas', '4')->findAll(),
            'erasers' => (new PenghapusModel())->where('id_kelas', '4')->findAll(),
---
SELECT *
FROM `meja`
WHERE `id_kelas` = '2'
SELECT *
FROM `kursi`
WHERE `id_kelas` = '2'
SELECT *
FROM `foto`
WHERE `id_kelas` = '2'
SELECT *
FROM `papan_tulis`
WHERE `id_kelas` = '2'
SELECT *
FROM `spidol`
WHERE `id_kelas` = '2'
SELECT *
FROM `pena`
WHERE `id_kelas` = '2'
SELECT *
FROM `penggaris`
WHERE `id_kelas` = '2'
SELECT *
FROM `penghapus`
WHERE `id_kelas` = '2'